# Pandas End-to-End Analysis

## Objective
Demonstrate the ability to combine datasets and reshape data
to support comprehensive business analysis.

In [10]:
import pandas as pd
import numpy as np

df = pd.read_csv("data/superstore_cleaned.csv",encoding="latin1")
df

,order_id,order_date,ship_date,ship_mode,customer_id,customer_name,segment,country,city,state,product_id,category,sub-category,product_name,sales
0,CA-2017-152156,2017-11-08,2017-11-11,Second Class,CG-12520,Claire Gute,Consumer,United States,Henderson,Kentucky,FUR-BO-10001798,Furniture,Bookcases,Bush Somerset Collection Bookcase,261.9600
1,CA-2017-152156,2017-11-08,2017-11-11,Second Class,CG-12520,Claire Gute,Consumer,United States,Henderson,Kentucky,FUR-CH-10000454,Furniture,Chairs,"Hon Deluxe Fabric Upholstered Stacking Chairs,...",731.9400
2,CA-2017-138688,2017-06-12,2017-06-16,Second Class,DV-13045,Darrin Van Huff,Corporate,United States,Los Angeles,California,OFF-LA-10000240,Office Supplies,Labels,Self-Adhesive Address Labels for Typewriters b...,14.6200
3,US-2016-108966,2016-10-11,2016-10-18,Standard Class,SO-20335,Sean O'Donnell,Consumer,United States,Fort Lauderdale,Florida,FUR-TA-10000577,Furniture,Tables,Bretford CR4500 Series Slim Rectangular Table,957.5775
4,US-2016-108966,2016-10-11,2016-10-18,Standard Class,SO-20335,Sean O'Donnell,Consumer,United States,Fort Lauderdale,Florida,OFF-ST-10000760,Office Supplies,Storage,Eldon Fold 'N Roll Cart System,22.3680
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
9733,CA-2015-127166,2015-05-21,2015-05-23,Second Class,KH-16360,Katherine Hughes,Consumer,United States,Houston,Texas,OFF-BI-10000977,Office Supplies,Binders,Ibico Plastic Spiral Binding Combs,18.2400
9734,CA-2017-125920,2017-05-21,2017-05-28,Standard Class,SH-19975,Sally Hughsby,Corporate,United States,Chicago,Illinois,OFF-BI-10003429,Office Supplies,Binders,"Cardinal HOLDit! Binder Insert Strips,Extra St...",3.7980
9735,CA-2016-128608,2016-01-12,2016-01-17,Standard Class,CS-12490,Cindy Schnelling,Corporate,United States,Toledo,Ohio,TEC-PH-10004977,Technology,Phones,GE 30524EE4,235.1880
9736,CA-2016-128608,2016-01-12,2016-01-17,Standard Class,CS-12490,Cindy Schnelling,Corporate,United States,Toledo,Ohio,TEC-PH-10000912,Technology,Phones,Anker 24W Portable Micro USB Car Charger,26.3760
9737,CA-2016-128608,2016-01-12,2016-01-17,Standard Class,CS-12490,Cindy Schnelling,Corporate,United States,Toledo,Ohio,TEC-AC-10000487,Technology,Accessories,SanDisk Cruzer 4 GB USB Flash Drive,10.3840

In [9]:
cust_df = (df.groupby("customer_id").agg(customer_name=("customer_name","first"),
                                       total_orders=("order_id","nunique"),
                                       total_sales=("sales","sum")).reset_index())
cust_df

    customer_id       customer_name  total_orders  total_sales
0      AA-10315          Alex Avila             5     5563.560
1      AA-10375        Allen Armold             9     1056.390
2      AA-10480        Andrew Allen             4     1790.512
3      AA-10645       Anna Andreadi             6     5086.935
4      AB-10015       Aaron Bergman             3      886.156
..          ...                 ...           ...          ...
787    XP-21865        Xylona Preis            11     2374.658
788    YC-21895      Yoseph Carroll             5     5454.350
789    YS-21880       Yana Sorensen             8     6720.444
790    ZC-21910    Zuschuss Carroll            13     8025.707
791    ZD-21925  Zuschuss Donatelli             5     1280.464

[792 rows x 4 columns]

In [21]:
state_sales = (df.groupby("state").agg(total_orders=("order_id","nunique"),
                                       total_sales=("sales","sum")).reset_index().sort_values(by="total_sales",ascending=False))
state_sales

                   state  total_orders  total_sales
3             California           997  442579.1485
30              New York           546  306209.0070
41                 Texas           478  166356.8382
45            Washington           254  135022.0020
36          Pennsylvania           284  111986.0970
8                Florida           197   87311.0440
11              Illinois           269   79213.6130
20              Michigan           115   75644.5240
33                  Ohio           227   74971.9820
44              Virginia           115   70532.7100
31        North Carolina           134   55156.5720
12               Indiana            70   48680.1800
9                Georgia            87   48219.1100
15              Kentucky            59   36458.3900
1                Arizona           107   35249.4570
28            New Jersey            57   34604.4320
4               Colorado            78   31266.6620
47             Wisconsin            52   31160.2300
40             Tennessee            91   30661.8730
21             Minnesota            43   29821.9500
19         Massachusetts            62   28634.4340
6               Delaware            43   27322.9990
18              Maryland            46   23705.5230
37          Rhode Island            24   22525.0260
23              Missouri            30   22195.4700
34              Oklahoma            34   19683.3900
0                Alabama            34   19302.4800
26                Nevada            23   16729.1020
35                Oregon            54   16394.1580
5            Connecticut            45   13384.3570
2               Arkansas            27   11678.1300
42                  Utah            25   11164.5560
22           Mississippi            26   10771.3400
16             Louisiana            20    9131.0500
43               Vermont             6    8929.3700
38        South Carolina            20    8481.7100
25              Nebraska            23    7464.9300
27         New Hampshire            17    7292.5240
24               Montana             8    5589.3520
29            New Mexico            22    4772.1060
13                  Iowa            16    4443.5600
10                 Idaho            11    4382.4860
14                Kansas            14    2914.3100
7   District of Columbia             4    2865.0200
48               Wyoming             1    1603.1360
39          South Dakota             5    1315.5600
17                 Maine             3    1270.5300
46         West Virginia             2    1209.8240
32          North Dakota             2     919.9100

In [31]:
product_level_df = (
    df.groupby(["category", "sub-category"])
      .agg(
          products_count=("product_name", "count"),
          products_sales=("sales", "sum")
      )
      .reset_index()
)

product_level_df

           category sub-category  products_count  products_sales
0         Furniture    Bookcases             224     110609.9357
1         Furniture       Chairs             603     319802.3010
2         Furniture  Furnishings             925      88957.0800
3         Furniture       Tables             311     200669.2760
4   Office Supplies   Appliances             457     104295.3430
5   Office Supplies          Art             779      26394.1940
6   Office Supplies      Binders            1480     199378.3300
7   Office Supplies    Envelopes             247      16112.7660
8   Office Supplies    Fasteners             212       2987.3800
9   Office Supplies       Labels             354      11838.3560
10  Office Supplies        Paper            1333      76632.5160
11  Office Supplies      Storage             826     218024.9220
12  Office Supplies     Supplies             183      46409.3580
13       Technology  Accessories             752     163877.8100
14       Technology      Copiers              66     146248.0940
15       Technology     Machines             115     189238.6310
16       Technology       Phones             871     325705.8720

In [35]:
Top_order_sub_category = (
    df.groupby("sub-category")
      .agg(
          customer_count=("customer_id", "count"))
      .reset_index().sort_values(by="customer_count",ascending=False)
)

Top_order_sub_category

   sub-category  customer_count
3       Binders            1480
12        Paper            1333
9   Furnishings             925
13       Phones             871
14      Storage             826
2           Art             779
0   Accessories             752
5        Chairs             603
1    Appliances             457
10       Labels             354
16       Tables             311
7     Envelopes             247
4     Bookcases             224
8     Fasteners             212
15     Supplies             183
11     Machines             115
6       Copiers              66

Subset DataFrames are designed for ease of analysis and to replicate the analysis of data at different levels of detail for real-world scenarios.

The following aspects were analyzed using the above subsets:
- Total Orders, Total Sales by Customer
- Order volume and sales performance by state
- Product count and total sales by sub-category - Customer distribution for various sub-categories

In [41]:
cust_orders = (
    df.groupby("customer_id")
      .agg(
          orders_count=("order_id", "count"))
      .reset_index()
)

cust_orders

    customer_id  orders_count
0      AA-10315            11
1      AA-10375            15
2      AA-10480            12
3      AA-10645            18
4      AB-10015             6
..          ...           ...
787    XP-21865            28
788    YC-21895             8
789    YS-21880            12
790    ZC-21910            31
791    ZD-21925             8

[792 rows x 2 columns]

In [47]:
customer_details = (df.groupby("customer_id").agg(
    customer_name=("customer_name","first"),
    state=("state", "first"),
    city=("city", "first")).reset_index())

customer_details

    customer_id       customer_name           state           city
0      AA-10315          Alex Avila       Minnesota    Minneapolis
1      AA-10375        Allen Armold         Arizona           Mesa
2      AA-10480        Andrew Allen  North Carolina        Concord
3      AA-10645       Anna Andreadi    Pennsylvania        Chester
4      AB-10015       Aaron Bergman      Washington        Seattle
..          ...                 ...             ...            ...
787    XP-21865        Xylona Preis      California      San Diego
788    YC-21895      Yoseph Carroll      California  San Francisco
789    YS-21880       Yana Sorensen  North Carolina     Burlington
790    ZC-21910    Zuschuss Carroll          Oregon          Salem
791    ZD-21925  Zuschuss Donatelli      California  San Francisco

[792 rows x 4 columns]

In [51]:
pd.merge(cust_orders,customer_details, on="customer_id",how="inner")

,customer_id,orders_count,customer_name,state,city
0,AA-10315,11,Alex Avila,Minnesota,Minneapolis
1,AA-10375,15,Allen Armold,Arizona,Mesa
2,AA-10480,12,Andrew Allen,North Carolina,Concord
3,AA-10645,18,Anna Andreadi,Pennsylvania,Chester
4,AB-10015,6,Aaron Bergman,Washington,Seattle
...,...,...,...,...,...
787,XP-21865,28,Xylona Preis,California,San Diego
788,YC-21895,8,Yoseph Carroll,California,San Francisco
789,YS-21880,12,Yana Sorensen,North Carolina,Burlington
790,ZC-21910,31,Zuschuss Carroll,Oregon,Salem
791,ZD-21925,8,Zuschuss Donatelli,California,San Francisco

The DataFrame for the orders subset is then merged with the customer details subset to consolidate customer-level information in one view.

JOIN methods was used to keep common records from tables and enrich them. That would involve updating the database record with the customer details while making sure that no transactional data was lost.

In [60]:
pd.pivot_table(
    data=df,
    values="sales",
    index="category",
    columns="sub-category",
    aggfunc="count",
    fill_value=0
)

sub-category,Accessories,Appliances,Art,Binders,Bookcases,Chairs,Copiers,Envelopes,Fasteners,Furnishings,Labels,Machines,Paper,Phones,Storage,Supplies,Tables
category,,,,,,,,,,,,,,,,,
Furniture,0,0,0,0,224,603,0,0,0,925,0,0,0,0,0,0,311
Office Supplies,0,457,779,1480,0,0,0,247,212,0,354,0,1333,0,826,183,0
Technology,752,0,0,0,0,0,66,0,0,0,0,115,0,871,0,0,0

The pivot table gives a structured comparison of the presence of sub-category in various categories of products.
The rows represent categories, columns represent sub-categories, and values represent the count of sub-category occurrences.
In this way, missing combinations are indicated as zero.

In [62]:
df.melt(id_vars=["sub-category"])

       sub-category  variable           value
0         Bookcases  order_id  CA-2017-152156
1            Chairs  order_id  CA-2017-152156
2            Labels  order_id  CA-2017-138688
3            Tables  order_id  US-2016-108966
4           Storage  order_id  US-2016-108966
...             ...       ...             ...
136327      Binders     sales           18.24
136328      Binders     sales           3.798
136329       Phones     sales         235.188
136330       Phones     sales          26.376
136331  Accessories     sales          10.384

[136332 rows x 3 columns]

The dataset was reshaped into long format to support flexible analysis based on columns.

## Final Insights
- Clear performance differences exist across product categories and customer segments.
- Certain segments contribute less revenue and may require strategic improvement.
- Category-level performance suggests where marketing and sales efforts should be focused.

### Business Recommendation
Focus resources on high-performing categories while designing targeted strategies
to improve underperforming segments.

## Final Insights
- Patterns in customer, category, and regional performance are easier to understand if the analysis is done on multiple levels.
- Combining relevant datasets creates a more comprehensive and meaningful analytical perspective.
- Pivot and reshaping techniques are useful to compare the performance effectively.

### Business Conclusion

The performance of sales is influenced by a mix of factors including category strength and customer concentration. Further, regional variance is also observed. ### Recommendation The focus should be on the top-performing categories and regions, while developing strategies to improve the low-performing categories and customer groups.